def area(a, b): 
    """
    Вычисляет площадь треугольника.
    
    Параметры:
        a (float): Длина основания треугольника.
        b (float): Высота треугольника.
    
    Возвращает:
        float: Площадь треугольника.
    """
    return a * b / 2 

def perimeter(a, b, c): 
    """
    Вычисляет периметр треугольника.
    
    Параметры:
        a (float): Длина стороны a.
        b (float): Длина стороны b.
        c (float): Длина стороны c.
    
    Возвращает:
        float: Периметр треугольника.
    """
    return a + b + c